Update architecture.md
